benchmarks/lora/definitive_results/performance_analysis/loading_overhead/throughput/with_pre_loading/llama-2-7b/p25_dataset/_1_32__8_run_1/log_12999635.out
WARNING 12-14 17:44:48 _custom_ops.py:14] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=15460, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_p25.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=8, sharegpt_output_len=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, request_rate=inf, request_rate_by_lora=None, seed=0, trust_remote_code=False, disable_tqdm=True, save_result=True, metadata=None, result_dir='benchmarks/lora/definitive_results/theory/lora_overhead/throughput/pre_loading/llama-2-7b/p25_dataset/_1_32__8_run_1', launch_server=True, server_args='--port=15460 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b --enable-lora --lora-modules=sql-lora=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/llama/llama-2-7b/lora/yard1_sql-lora-test_dummy_rank_32/ --max-num-seqs=4096 --max-loras=1 --max-lora-rank=32', disable_log_stats=False, disable_loras_users=False, user_lora_request_relation=None, infinite_behaviour=False, restrict_loras=None, lora_pre_loading=True)
Server started
Requests users. Values: ['0']. Counts: [8]
Requests loras. Values: ['sql-lora']. Counts: [8]
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     8         
Benchmark duration (s):                  0.45      
Total input tokens:                      184       
Total generated tokens:                  216       
Request throughput (req/s):              17.70     
Input token throughput (tok/s):          407.08    
Output token throughput (tok/s):         477.88    
---------------Time to First Token----------------
Mean TTFT (ms):                          56.85     
Median TTFT (ms):                        65.52     
P99 TTFT (ms):                           65.87     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.15     
Median TPOT (ms):                        14.81     
P99 TPOT (ms):                           15.74     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.15     
Median ITL (ms):                         14.80     
P99 ITL (ms):                            37.70     
==================================================
Concurrent checker terminated
Server terminated